src/resurser/personsok-2019.1.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions name="PersonsokService"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:tns="http://statenspersonadressregister.se/personsok/2019.1"
                  xmlns:fraga="http://statenspersonadressregister.se/schema/komponent/sok/personsokningsfraga-1.0"
                  xmlns:svar="http://statenspersonadressregister.se/schema/komponent/sok/personsokningsvar-1.0"
                  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  targetNamespace="http://statenspersonadressregister.se/personsok/2019.1">
    <wsdl:types>
        <xsd:schema targetNamespace="http://statenspersonadressregister.se/schema/komponent/sok/personsokningsfraga-1.0">
            <xsd:include schemaLocation="http://xmls.statenspersonadressregister.se/se/spar/deladeKomponenter/sok/PersonsokningFraga-1.0.xsd"/>
        </xsd:schema>
        <xsd:schema targetNamespace="http://statenspersonadressregister.se/schema/komponent/sok/personsokningsvar-1.0">
            <xsd:include schemaLocation="http://xmls.statenspersonadressregister.se/se/spar/deladeKomponenter/sok/PersonsokningSvar-1.0.xsd"/>
        </xsd:schema>
    </wsdl:types>

    <wsdl:message name="PersonsokRequest">
        <wsdl:part element="fraga:SPARPersonsokningFraga" name="parameters"/>
    </wsdl:message>
    <wsdl:message name="PersonsokResponse">
        <wsdl:part element="svar:SPARPersonsokningSvar" name="parameters"/>
    </wsdl:message>

    <wsdl:portType name="PersonsokService">
        <wsdl:operation name="PersonSok">
            <wsdl:input message="tns:PersonsokRequest"/>
            <wsdl:output message="tns:PersonsokResponse"/>
        </wsdl:operation>
    </wsdl:portType>

    <wsdl:binding name="PersonsokServiceSOAP" type="tns:PersonsokService">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="PersonSok">
            <soap:operation soapAction="http://skatteverket.se/spar/personsok/2019.1/PersonsokService/Personsok"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>

    <wsdl:service name="PersonsokService">
        <wsdl:port binding="tns:PersonsokServiceSOAP" name="PersonsokServiceSOAP">
            <soap:address location="https://kt-ext-ws.statenspersonadressregister.se/2019.1/"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>